package ensyu6;

public class Q2 {
/*
 記述問題です。
回答の際には声に出さず、テキストエディタに書く、紙に書く　などでお願いします。

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ１

メソッドがどう実装するか決まっていない時、ある英単語をつけると
「あいまい」という意味になる。その英単語とは？

abstract

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ２

Ｑ１で答えた英単語をつけたメソッドは何と呼ばれているか。

抽象メソッド

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ３

Ｑ２で答えたメソッドと通常のメソッドとの記述の仕方での違いは？

メソッドにabstractをつける
メソッドの内容を記述しない
{}をつけず、;で終了する



ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ４

Ｑ２で答えたメソッドを定義した際にクラスの宣言に対して気を付ける事は？

abstract classにすること


ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ５

Ｑ４で答えたクラスを何というか。

抽象クラス

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ６

Ｑ５で答えたクラスが禁止されている事は？

newによるインスタンス化


ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ７

Ｑ２で答えたメソッドを継承したクラスに強制できる事とは？

継承したabstractメソッドのオーバーライド


ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ８

Ｑ７で答えた事をするとコンパイルエラーがなくなるが、
それ以外でコンパイルエラーにならない方法とは？

abstract classに設定する

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ９

多階層の抽象について。
継承図で上に辿れば辿るほどクラスはどうなるか？

抽象化する

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ10

多階層の抽象について。
継承図で下に辿れば辿るほどクラスはどうなるか？


具体的になる

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ11

インターフェースについて。
フィールドとメソッドの特徴は？

フィールド：持たない
メソッド : 内容を記述しない

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ12

通常クラスがインターフェイスを継承する際に用いる英単語は？

implements

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ13

インターフェイスがインターフェイスを継承する際に用いる英単語は？

extends
ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー


Ｑ14

通常クラスの継承では出来ないが、インターフェイスの継承で出来る事は？

多重継承

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ15

Ｑ14で答えた事について。
なぜ出来るのか？

メソッド内容が記述されていないため、内容で衝突が怒らないため

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

Ｑ16
クラスの宣言でextendsとimplementsを同時に用いることができるが、
順番はどうか（どのようにプログラムを書くか）？

public class NoteBoook extends Book implements Paper{
}


ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

 */

}
